## Plan Result (sbox_global)




<pre><code>Plan: 10 to add, 15 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_secret.certificate[&#34;plumclassic&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;plumclassic&#34;]
* Update
  * azurerm_storage_account.diagnostics
  * module.premium_front_door[0].azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;labs-goldenpath-mfox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;labs-rhodrif-nodejs&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_account.diagnostics will be updated in-place
  ~ resource "azurerm_storage_account" "diagnostics" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctscftdiagsbox"
        name                              = "hmctscftdiagsbox"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + expiration_date          = (known after apply)
      + host_name                = "frontdoor.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "plumclassic"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_endpoint.endpoint will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
        id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
        name                     = "hmcts-sbox"
      ~ tags                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtsboxPremium"
        name                              = "cftapimgmtsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssboxPremium"
        name                              = "hmctsaccesssboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["hmi-apim"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimsboxPremium"
        name                              = "hmiapimsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsboxPremium"
        name                              = "idamuserdashboardsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminsboxPremium"
        name                              = "idamwebadminsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsboxPremium"
        name                              = "idamwebpublicsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["labs-goldenpath-mfox"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsgoldenpathmfoxsboxPremium"
        name                              = "labsgoldenpathmfoxsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["labs-rhodrif-nodejs"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labsrhodrifnodejssboxPremium"
        name                              = "labsrhodrifnodejssboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["plum"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsboxPremium"
        name                              = "plumsboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "plumclassicsboxPremium"
      + resource_group_name   = "lz-sbox-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom["reformscan"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscansboxPremium"
        name                              = "reformscansboxPremium"
      ~ tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "plumclassic"
      + origin_host_header             = "frontdoor.sandbox.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                                                        = (known after apply)
      + name                                                      = "plumclassic"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_profile.front_door will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "front_door" {
        id                       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
        name                     = "hmcts-sbox"
      ~ tags                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.default_routing_rule will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "default_routing_rule" {
        id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox/routes/defaultRouting"
        name                            = "defaultRouting"
      ~ patterns_to_match               = [
          - "/test",
          + "/*",
        ]
        # (10 unchanged attributes hidden)
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "plumclassic"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/afdEndpoints/hmcts-sbox"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "plumclassicHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_secret.certificate["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + cdn_frontdoor_profile_name = (known after apply)
      + id                         = (known after apply)
      + name                       = "hmcts-sbox-managed-secret"

      + secret {
          + customer_certificate {
              + key_vault_certificate_id  = "https://acmedcdcftappssbox.vault.azure.net/certificates/frontdoor-sandbox-platform-hmcts-net/60c74416d8b54e81b1ea0aa65a9196f1"
              + subject_alternative_names = (known after apply)
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["plumclassic"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox"
      + id                       = (known after apply)
      + name                     = "plumclassicsboxPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/hmcts-sbox|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 15 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1858,"Program":"tfcmt","SHA1":"","Target":"sbox_global","Vars":{}} -->